levizh/zephyr/drivers/dma/dma_hc32.c
/*
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <device.h>
#include <dma.h>
#include <errno.h>
#include <init.h>
#include <stdio.h>
#include <soc.h>
#include <string.h>
#include <misc/util.h>
#include <drivers/dma/dma_hc32.h>
#include <interrupt_controller/intc_hc32.h>
#include <clock_control/hc32_clock_control.h>

#define LOG_LEVEL CONFIG_DMA_LOG_LEVEL
#include <logging/log.h>
LOG_MODULE_REGISTER(dma_hc32);

#include "hc32_ll.h"

#define DMA_MCU_MAX_BLOCK_SIZE	(1024UL)
#define DMA_MCU_MAX_BLOCK_CNT   (65535UL)
#define DMA_MCU_BLOCK_SIZE_MASK (DMA_DTCTL_BLKSIZE >> DMA_DTCTL_BLKSIZE_POS)

struct dma_hc32_config {
	u32_t base;
	u32_t channels;
	void (*fcg_configure)(void);
	void (*irq_configure)(void);
	void (*aos_configure)(void);
};

struct dma_hc32_channel {
	void (*callback)(void *callback_arg, u32_t channel,
			 int error_code);
	void *user_data;
	u32_t direction;
	u32_t data_width;
	u32_t burst_length;
	bool busy;
	u32_t aos_target;
	en_event_src_t aos_source;
	u32_t m2m_trigcnt;
	u32_t m2m_lastpkg;
	int m2m_err;
};

struct dma_hc32_data {
	struct dma_hc32_channel *channels;
};

struct dma_hc32_ddl_config {
	u32_t u32BlockSize;
	u32_t u32TransCount;
	u32_t u32DataWidth;
	u32_t u32DestAddr;
	u32_t u32SrcAddr;
	u32_t u32SrcAddrInc;
	u32_t u32DestAddrInc;
};

/* Check if the DMA init successfully for HC32F460 */
#define DMA_CH_REG(reg_base, ch)        (*(__IO uint32_t *)((uint32_t)(&(reg_base)) + ((ch) * 0x40UL)))
#define DMA_INIT_RETRY_CNT              (0x1000UL)

static int dma_hc32_init_check(CM_DMA_TypeDef *DMAx, uint32_t channel,
			       const stc_dma_init_t *pstcDmaInit)
{
	__IO uint32_t *CHCTLx;
	uint32_t u32BitsPos, u32BitsSetVal;
	uint32_t u32BlockSize = pstcDmaInit->u32BlockSize & DMA_MCU_BLOCK_SIZE_MASK;

	u32BitsPos    = DMA_CHCTL_IE | DMA_CHCTL_HSIZE | DMA_CHCTL_SINC |
			DMA_CHCTL_DINC;
	u32BitsSetVal = pstcDmaInit->u32IntEn | pstcDmaInit->u32DataWidth |
			pstcDmaInit->u32SrcAddrInc | pstcDmaInit->u32DestAddrInc;
	CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, channel);

	/* read back reg val to check */
	if ((pstcDmaInit->u32SrcAddr != DMA_GetSrcAddr(DMAx, channel)) ||      \
	    (pstcDmaInit->u32DestAddr != DMA_GetDestAddr(DMAx, channel)) ||    \
	    (pstcDmaInit->u32TransCount != DMA_GetTransCount(DMAx, channel)) || \
	    (u32BlockSize != DMA_GetBlockSize(DMAx, channel)) || \
	    (u32BitsSetVal != READ_REG32_BIT(*CHCTLx, u32BitsPos))) {
		return -EBUSY;
	}
	return 0;
}

static void dma_hc_sw_trigger(CM_DMA_TypeDef *DMAx, uint32_t channel)
{
	__IO uint32_t *SWREQ;
	SWREQ = (__IO uint32_t *)((uint32_t)DMAx + 0x30U);
	WRITE_REG32(*SWREQ, (0xA1UL << 16U) | (0x01UL << channel));
}

static u32_t dma_hc32_ch_is_en(CM_DMA_TypeDef *DMAx, uint32_t channel)
{
	u32_t u32ChEn;
	uint32_t u32Temp;
	u32Temp = (DMAx->CHEN & (0x01UL << channel));
	if (0UL != u32Temp) {
		u32ChEn = 1UL;
	} else {
		u32ChEn = 0UL;
	}
	return u32ChEn;
}

static void dma_hc32_force_ch_cmd(CM_DMA_TypeDef *DMAx, uint32_t channel,
				  en_functional_state_t enNewState)
{
	if (ENABLE == enNewState) {
		DMAx->CHEN |= (1UL << channel) & DMA_CHEN_CHEN;
	} else {
		DMAx->CHEN &= (~(1UL << channel)) & DMA_CHEN_CHEN;
	}
}

static void dma_hc32_ch_cmd(CM_DMA_TypeDef *DMAx, uint32_t channel,
			    en_functional_state_t enNewState)
{
	int32_t i32Ret = LL_OK;
	unsigned int key;

	key = irq_lock();
	if (ENABLE == enNewState) {
		i32Ret = DMA_ChCmd(DMAx, channel, ENABLE);
	} else {
		if (dma_hc32_ch_is_en(DMAx, channel)) {
			i32Ret = DMA_ChCmd(DMAx, channel, DISABLE);
		}
	}
	if (LL_OK != i32Ret) {
		dma_hc32_force_ch_cmd(DMAx, channel, enNewState);
	}
	irq_unlock(key);
}

static int dma_hc32_get_aos_target(CM_DMA_TypeDef *DMAx, u32_t channel,
				   u32_t *aos_target)
{
	u32_t aos_dma_trgsle_base;
	if (DMAx == CM_DMA1) {
		aos_dma_trgsle_base = AOS_DMA1_0;
	} else if (DMAx == CM_DMA2) {
		aos_dma_trgsle_base = AOS_DMA2_0;
	} else {
		LOG_ERR("DMAx error");
		return -EINVAL;
	}
	*aos_target = aos_dma_trgsle_base  + 0x04 * channel;
	return 0;
}

static void dma_hc32_m2m_calc_trigcnt_lastpkg_blocksize(u32_t *trigcnt,
							u32_t *lastpkg, u32_t *blocksize)
{
	u32_t in_blocksize = *blocksize, out_blocksize;
	u32_t m2m_trigcnt, m2m_lastpkg;
	m2m_trigcnt = in_blocksize / DMA_MCU_MAX_BLOCK_SIZE;
	m2m_lastpkg = in_blocksize % DMA_MCU_MAX_BLOCK_SIZE;
	if (m2m_lastpkg != 0) {
		m2m_trigcnt++;
	} else {
		m2m_lastpkg = DMA_MCU_MAX_BLOCK_SIZE;
	}
	if (m2m_trigcnt != 1) {
		out_blocksize = DMA_MCU_MAX_BLOCK_SIZE;
	} else {
		out_blocksize = m2m_lastpkg;
	}
	*trigcnt = m2m_trigcnt;
	*lastpkg = m2m_lastpkg;
	*blocksize = out_blocksize;

}

static void dma_hc32_clear_int_flag(CM_DMA_TypeDef *DMAx, u32_t channel)
{
	/* Int status clear */
	DMA_ClearTransCompleteStatus(DMAx,
				     (DMA_FLAG_BTC_CH0 << channel) | (DMA_FLAG_TC_CH0 << channel));
	DMA_ClearErrStatus(DMAx,
			   ((DMA_INT_REQ_ERR_CH0 << channel) | (DMA_INT_TRANS_ERR_CH0 << channel)));
}

static int dma_hc32_configure(struct device *dev, u32_t channel,
			      struct dma_config *dma_cfg)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	const struct dma_hc32_config_user_data *dma_cfg_user_data =
			dma_cfg->callback_arg;
	struct dma_hc32_data *data = dev->driver_data;
	struct dma_hc32_ddl_config dma_ddl_cfg;
	stc_dma_init_t stcDmaInit;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);
	u32_t u32InitRetryCnt = 0U;

	if (channel >= cfg->channels) {
		LOG_ERR("channel must be < %" PRIu32 " (%" PRIu32 ")",
			cfg->channels, channel);
		return -EINVAL;
	}

	if (data->channels[channel].busy) {
		LOG_ERR("dma channel %d is busy.", channel);
		return -EBUSY;
	}

	/* dam_cfg parameters check */

	/* These dma_cfg parameters do not care :
		dma_cfg->source_handshake
		dma_cfg->dest_handshake
		dma_cfg->channel_priority
	*/

	if ((dma_cfg->source_chaining_en != 0) || (dma_cfg->dest_chaining_en != 0)) {
		LOG_ERR("channel chaining transfer not supported now.");
		return -ENOTSUP;
	}

	if (dma_cfg->block_count != 1) {
		LOG_ERR("block_count != 1 not supported now.");
		return -ENOTSUP;
	}

	if (dma_cfg->source_data_size != dma_cfg->dest_data_size) {
		LOG_ERR("source_data_size != dest_data_size transfer not supported.");
		return -ENOTSUP;
	}

