levizh/zephyr/drivers/dma/dma_hc32.c
	if (dma_cfg->source_burst_length != dma_cfg->dest_burst_length) {
		LOG_ERR("source_burst_length != dest_burst_length transfer not supported.");
		return -ENOTSUP;
	}

	if (dma_cfg->source_burst_length > DMA_MCU_MAX_BLOCK_SIZE) {
		LOG_ERR("burst_length too large.");
		return -EINVAL;
	}

	/* block_cfg parameters check */
	if ((dma_cfg->head_block->source_gather_en != 0)
	    || (dma_cfg->head_block->dest_scatter_en != 0)) {
		LOG_ERR("block source_gather or dest_scatter transfer not supported now.");
		return -ENOTSUP;
	}

	if ((dma_cfg->head_block->source_reload_en != 0)
	    || (dma_cfg->head_block->dest_reload_en != 0)) {
		LOG_ERR("block source_reload or dest_reload transfer not supported now.");
		return -ENOTSUP;
	}

	if ((dma_cfg->head_block->block_size % (dma_cfg->source_data_size *
						dma_cfg->source_burst_length)) != 0) {
		LOG_ERR("block_size is not an integer multiple of (data_size*burst_length).");
		return -ENOTSUP;
	}

	if (dma_cfg->complete_callback_en != 0) {
		LOG_ERR("support callback invoked at completion only.");
		return -ENOTSUP;
	}

	/* dma_cfg->head_block->block_size is num of bytes to be transfer */
	if (dma_cfg->channel_direction == MEMORY_TO_MEMORY) {
		/* mem to mem single trig: cnt=0
		   cfg_block_size ---> mcu_dma_block_size
		   mcu_dma_block_cnt fix to 1UL */
		dma_ddl_cfg.u32BlockSize = dma_cfg->head_block->block_size /
					   dma_cfg->source_data_size;
		dma_ddl_cfg.u32TransCount = 1UL;
	} else {
		/* others peripheral trig : cnt--
		   cfg_block_size ---> mcu_dma_block_cnt
		   mcu_dma_block_size set to dma_cfg->source_burst_length */
		dma_ddl_cfg.u32BlockSize = dma_cfg->source_burst_length;
		dma_ddl_cfg.u32TransCount = dma_cfg->head_block->block_size /
					    (dma_cfg->source_data_size * dma_cfg->source_burst_length);
		if (dma_ddl_cfg.u32TransCount > DMA_MCU_MAX_BLOCK_CNT) {
			LOG_ERR("block size must be < %" PRIu32 " (%" PRIu32 ")",
				(u32_t)(DMA_MCU_MAX_BLOCK_CNT / (dma_cfg->source_data_size *
								 dma_cfg->source_burst_length)),
				dma_cfg->head_block->block_size);
			return -EINVAL;
		}
	}

	switch (dma_cfg->source_data_size) {
	case 1U:
		dma_ddl_cfg.u32DataWidth = DMA_DATAWIDTH_8BIT;
		break;
	case 2U:
		dma_ddl_cfg.u32DataWidth = DMA_DATAWIDTH_16BIT;
		break;
	case 4U:
		dma_ddl_cfg.u32DataWidth = DMA_DATAWIDTH_32BIT;
		break;
	default:
		LOG_ERR("source_data_size error.");
		return -ENOTSUP;
		break;
	}

	dma_ddl_cfg.u32SrcAddr  = dma_cfg->head_block->source_address;
	dma_ddl_cfg.u32DestAddr = dma_cfg->head_block->dest_address;

	if (dma_cfg->head_block->source_addr_adj == DMA_ADDR_ADJ_INCREMENT) {
		dma_ddl_cfg.u32SrcAddrInc = DMA_SRC_ADDR_INC;
	} else if (dma_cfg->head_block->source_addr_adj == DMA_ADDR_ADJ_DECREMENT) {
		dma_ddl_cfg.u32SrcAddrInc = DMA_SRC_ADDR_DEC;
	} else {
		dma_ddl_cfg.u32SrcAddrInc = DMA_SRC_ADDR_FIX;
	}

	if (dma_cfg->head_block->dest_addr_adj == DMA_ADDR_ADJ_INCREMENT) {
		dma_ddl_cfg.u32DestAddrInc = DMA_DEST_ADDR_INC;
	} else if (dma_cfg->head_block->dest_addr_adj == DMA_ADDR_ADJ_DECREMENT) {
		dma_ddl_cfg.u32DestAddrInc = DMA_DEST_ADDR_DEC;
	} else {
		dma_ddl_cfg.u32DestAddrInc = DMA_DEST_ADDR_FIX;
	}

	data->channels[channel].callback = dma_cfg->dma_callback;
	data->channels[channel].user_data = dma_cfg->callback_arg;
	data->channels[channel].direction = dma_cfg->channel_direction;
	data->channels[channel].data_width = dma_cfg->source_data_size;
	data->channels[channel].burst_length = dma_cfg->source_burst_length;
	if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
		dma_hc32_m2m_calc_trigcnt_lastpkg_blocksize(
			&data->channels[channel].m2m_trigcnt, &data->channels[channel].m2m_lastpkg,
			&dma_ddl_cfg.u32BlockSize);
	}

	if (dma_cfg_user_data != NULL) {
		data->channels[channel].aos_source = dma_cfg_user_data->slot;
	} else {
		LOG_WRN("hc32 dma should use config->callback_arg to select trig source, but is NULL !");
	}
	if (0 != dma_hc32_get_aos_target(DMAx, channel,
					 &data->channels[channel].aos_target)) {
		return -EINVAL;
	}

	if ((data->channels[channel].direction == MEMORY_TO_MEMORY)
	    && (data->channels[channel].aos_source != EVT_SRC_AOS_STRG)) {
		LOG_WRN("note: dma mem to mem, but trig source not EVT_SRC_AOS_STRG !");
		data->channels[channel].aos_source = EVT_SRC_AOS_STRG;
		LOG_WRN("note: force trig source to EVT_SRC_AOS_STRG !");
	}

	dma_hc32_ch_cmd(DMAx, channel, DISABLE);

	/* Int status clear */
	dma_hc32_clear_int_flag(DMAx, channel);

	/* MEMORY_TO_MEMORY: use dma independent sw trigger */
	if (MEMORY_TO_MEMORY != data->channels[channel].direction) {
		AOS_SetTriggerEventSrc(data->channels[channel].aos_target,
				       data->channels[channel].aos_source);
	}

	(void)DMA_StructInit(&stcDmaInit);

	stcDmaInit.u32IntEn      = DMA_INT_ENABLE;
	stcDmaInit.u32BlockSize  = dma_ddl_cfg.u32BlockSize;
	stcDmaInit.u32TransCount = dma_ddl_cfg.u32TransCount;
	stcDmaInit.u32DataWidth  = dma_ddl_cfg.u32DataWidth;
	stcDmaInit.u32SrcAddr    = dma_ddl_cfg.u32SrcAddr;
	stcDmaInit.u32DestAddr   = dma_ddl_cfg.u32DestAddr;
	stcDmaInit.u32SrcAddrInc = dma_ddl_cfg.u32SrcAddrInc;
	stcDmaInit.u32DestAddrInc = dma_ddl_cfg.u32DestAddrInc;

	for (u32InitRetryCnt = 0; u32InitRetryCnt < DMA_INIT_RETRY_CNT;
	     u32InitRetryCnt++) {
		(void)DMA_Init(DMAx, channel, &stcDmaInit);
		if (0 == dma_hc32_init_check(DMAx, channel, &stcDmaInit)) {
			break;
		}
	}
	if (u32InitRetryCnt == DMA_INIT_RETRY_CNT) {
		return -EBUSY;
	}


	/* only TC enable, BTC disable */
	DMA_TransCompleteIntCmd(DMAx, DMA_INT_BTC_CH0 << channel, DISABLE);

	if (dma_cfg->error_callback_en != 0) {
		DMA_ErrIntCmd(DMAx, (DMA_INT_REQ_ERR_CH0 << channel) | (DMA_INT_TRANS_ERR_CH0 <<
									channel), DISABLE);
	}

	DMA_Cmd(DMAx, ENABLE);

	return 0;
}

static int dma_hc32_reload(struct device *dev, u32_t channel,
			   u32_t src, u32_t dst, size_t size)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);
	u32_t u32TransSize;

	if (channel >= cfg->channels) {
		LOG_ERR("reload channel must be < %" PRIu32 " (%" PRIu32 ")",
			cfg->channels, channel);
		return -EINVAL;
	}

