levizh/zephyr/drivers/dma/dma_hc32.c
	if (data->channels[channel].busy) {
		LOG_ERR("dma channel %d is busy.", channel);
		return -EBUSY;
	}

	if ((size % (data->channels[channel].data_width *
		     data->channels[channel].burst_length)) != 0) {
		LOG_ERR("size is not an integer multiple of data_width*.burst_length");
		return -ENOTSUP;
	}

	if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
		u32TransSize = size / data->channels[channel].data_width;
		dma_hc32_m2m_calc_trigcnt_lastpkg_blocksize(
			&data->channels[channel].m2m_trigcnt, &data->channels[channel].m2m_lastpkg,
			&u32TransSize);
	} else {
		u32TransSize = size / (data->channels[channel].data_width *
				       data->channels[channel].burst_length);
		if (u32TransSize > DMA_MCU_MAX_BLOCK_CNT) {
			LOG_ERR("block size must be < %" PRIu32 " (%" PRIu32 ")",
				(u32_t)(DMA_MCU_MAX_BLOCK_CNT / data->channels[channel].data_width),
				size);
			return -EINVAL;
		}
	}

	dma_hc32_ch_cmd(DMAx, channel, DISABLE);

	/* Int status clear */
	dma_hc32_clear_int_flag(DMAx, channel);

	if (LL_OK != DMA_SetSrcAddr(DMAx, channel, src)) {
		return -EBUSY;
	}
	if (LL_OK != DMA_SetDestAddr(DMAx, channel, dst)) {
		return -EBUSY;
	}

	if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
		u32TransSize = u32TransSize & DMA_MCU_BLOCK_SIZE_MASK;
		if (LL_OK != DMA_SetBlockSize(DMAx, channel, u32TransSize)) {
			return -EBUSY;
		}
		if (LL_OK != DMA_SetTransCount(DMAx, channel, 1U)) {
			return -EBUSY;
		}
	} else {
		if (LL_OK != DMA_SetTransCount(DMAx, channel, u32TransSize)) {
			return -EBUSY;
		}
	}

	return 0;
}

static int dma_hc32_start(struct device *dev, u32_t channel)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);
	unsigned int key;

	if (channel >= cfg->channels) {
		LOG_ERR("start channel must be < %" PRIu32 " (%" PRIu32 ")",
			cfg->channels, channel);
		return -EINVAL;
	}

	/* Int status clear */
	dma_hc32_clear_int_flag(DMAx, channel);

	dma_hc32_ch_cmd(DMAx, channel, ENABLE);
	data->channels[channel].busy = true;
	if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
		if (EVT_SRC_AOS_STRG == data->channels[channel].aos_source) {
			key = irq_lock();
			dma_hc_sw_trigger(DMAx, channel);
			data->channels[channel].m2m_trigcnt--;
			data->channels[channel].m2m_err = 0;
			irq_unlock(key);
		}
	}

	return 0;
}


static int dma_hc32_stop(struct device *dev, u32_t channel)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);

	if (channel >= cfg->channels) {
		LOG_ERR("start channel must be < %" PRIu32 " (%" PRIu32 ")",
			cfg->channels, channel);
		return -EINVAL;
	}
	if (dma_hc32_ch_is_en(DMAx, channel)) {
		if (LL_OK != DMA_ChCmd(DMAx, channel, DISABLE)) {
			LOG_ERR("could not disable dma ch %d.", channel);
			return -EBUSY;
		}
	}
	data->channels[channel].busy = false;

	return 0;
}

int dma_hc32_get_status(struct device *dev, u32_t channel,
			struct dma_hc32_status *stat)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);
	uint32_t pending_trigcnt;
	uint32_t u32BlockSize;

	if (channel >= cfg->channels) {
		LOG_ERR("channel must be < %" PRIu32 " (%" PRIu32 ")",
			cfg->channels, channel);
		return -EINVAL;
	}

	u32BlockSize = DMA_GetBlockSize(DMAx, channel);
	u32BlockSize = (0UL == u32BlockSize) ? DMA_MCU_MAX_BLOCK_SIZE : u32BlockSize;

	stat->pending_length = DMA_GetTransCount(DMAx, channel) * u32BlockSize * \
			       data->channels[channel].data_width;
	if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
		pending_trigcnt = data->channels[channel].m2m_trigcnt;
		if (pending_trigcnt >= 1) {
			stat->pending_length = stat->pending_length + ((pending_trigcnt - 1) *
								       DMA_MCU_MAX_BLOCK_SIZE + data->channels[channel].m2m_lastpkg) *
					       data->channels[channel].data_width;
		}
	}

	stat->dir = data->channels[channel].direction;
	stat->busy = data->channels[channel].busy;

	return 0;
}

static const struct dma_driver_api dma_hc32_driver_api = {
	.config = dma_hc32_configure,
	.reload = dma_hc32_reload,
	.start = dma_hc32_start,
	.stop = dma_hc32_stop,
};

static void dma_hc32_err_irq_handler(struct device *dev)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);

	for (u32_t ch = 0; ch < cfg->channels; ch++) {
		if (DMAx->INTMASK0 & ((DMA_INT_REQ_ERR_CH0 << ch) |
				      (DMA_INT_TRANS_ERR_CH0 << ch))) {
			if (SET == DMA_GetErrStatus(DMAx,
						    ((DMA_INT_REQ_ERR_CH0 << ch) | (DMA_INT_TRANS_ERR_CH0 << ch)))) {
				DMA_ClearErrStatus(DMAx,
						   ((DMA_INT_REQ_ERR_CH0 << ch) | (DMA_INT_TRANS_ERR_CH0 << ch)));
				data->channels[ch].busy = false;
				if (data->channels[ch].callback) {
					data->channels[ch].callback(data->channels[ch].user_data,
								    ch, -EIO);
				}
			}
		}
	}
}

static void dma_hc32_tc_irq_handler(struct device *dev, int channel)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);
	u32_t u32TransSize;
	unsigned int key;

	if (SET == DMA_GetTransCompleteStatus(DMAx, DMA_FLAG_TC_CH0 << channel)) {
		DMA_ClearTransCompleteStatus(DMAx, DMA_FLAG_TC_CH0 << channel);
		if (data->channels[channel].direction == MEMORY_TO_MEMORY) {
			if (data->channels[channel].m2m_trigcnt == 0) { /* all done */
				data->channels[channel].busy = false;
				if (data->channels[channel].callback) {
					data->channels[channel].callback(data->channels[channel].user_data,
									 channel, data->channels[channel].m2m_err);
				}
			} else {
				if (data->channels[channel].m2m_trigcnt == 1) { /* last pkg */
					u32TransSize = data->channels[channel].m2m_lastpkg;
				} else {
					u32TransSize = DMA_MCU_MAX_BLOCK_SIZE;
				}
				u32TransSize = u32TransSize & DMA_MCU_BLOCK_SIZE_MASK;
				if ((LL_OK != DMA_SetBlockSize(DMAx, channel, u32TransSize)) || \
				    (LL_OK != DMA_SetTransCount(DMAx, channel, 1U))) {
					data->channels[channel].m2m_err = -EIO;
				}

				dma_hc32_ch_cmd(DMAx, channel, ENABLE);
				if (EVT_SRC_AOS_STRG == data->channels[channel].aos_source) {
					key = irq_lock();
					dma_hc_sw_trigger(DMAx, channel);
					data->channels[channel].m2m_trigcnt--;
					irq_unlock(key);
				}
			}
		} else {
			data->channels[channel].busy = false;
			if (data->channels[channel].callback) {
				data->channels[channel].callback(data->channels[channel].user_data,
								 channel, 0);
			}
		}
	}
}

static int dma_hc32_init(struct device *dev)
{
	const struct dma_hc32_config *cfg = dev->config->config_info;
	struct dma_hc32_data *data = dev->driver_data;
	CM_DMA_TypeDef *DMAx = ((CM_DMA_TypeDef *)cfg->base);

	cfg->fcg_configure();

	for (u32_t ch = 0; ch < cfg->channels; ch++) {
		dma_hc32_clear_int_flag(DMAx, ch);
		data->channels[ch].busy = false;
	}

	cfg->aos_configure();
	cfg->irq_configure();

