levizh/zephyr/drivers/dma/dma_hc32.c
	return 0;
}

#define DMA_HC32_DEFINE_TC_IRQ_HANDLER(ch, inst)                      \
static void dma_hc32_tc_irq_handler_##inst##_##ch(struct device *dev) \
{                                                                     \
	dma_hc32_tc_irq_handler(dev, ch);                                 \
}

#define DMA_HC32_DEFINE_ERR_IRQ_HANDLER(inst)                         \
static void dma_hc32_err_irq_handler_##inst(struct device *dev)       \
{                                                                     \
	dma_hc32_err_irq_handler(dev);                                    \
}

#define DMA_HC32_TC_IRQ_CONFIG(ch, inst)                              \
{                                                                     \
	IRQ_CONNECT(DT_XHSC_HC32_DMA_##inst##_IRQ_TC##ch,                 \
		    DT_XHSC_HC32_DMA_##inst##_IRQ_TC##ch##_PRIORITY,          \
			dma_hc32_tc_irq_handler_##inst##_##ch,                    \
		    DEVICE_GET(dma_hc32_##inst), 0);                          \
	hc32_intc_irq_signin(DT_XHSC_HC32_DMA_##inst##_IRQ_TC##ch,        \
			     DT_XHSC_HC32_DMA_##inst##_IRQ_TC##ch##_INT_SRC);     \
	irq_enable(DT_XHSC_HC32_DMA_##inst##_IRQ_TC##ch);                 \
}

#define DMA_HC32_ERR_IRQ_CONFIG(inst)                                 \
{                                                                     \
	IRQ_CONNECT(DT_XHSC_HC32_DMA_##inst##_IRQ_ERR,                    \
		    DT_XHSC_HC32_DMA_##inst##_IRQ_ERR_PRIORITY,               \
			 dma_hc32_err_irq_handler_##inst,                         \
		    DEVICE_GET(dma_hc32_##inst), 0);                          \
	hc32_intc_irq_signin(DT_XHSC_HC32_DMA_##inst##_IRQ_ERR,           \
			     DT_XHSC_HC32_DMA_##inst##_IRQ_ERR_INT_SRC);          \
	irq_enable(DT_XHSC_HC32_DMA_##inst##_IRQ_ERR);                    \
}

#define DMA_HC32_DEFINE_IRQ_CONFIG(inst)                                              \
DEVICE_DECLARE(dma_hc32_##inst);                                                      \
static void dma_hc32_##inst##_irq_configure(void)                                     \
{                                                                                     \
	UTIL_LISTIFY(DT_XHSC_HC32_DMA_##inst##_DMA_CHANNELS, DMA_HC32_TC_IRQ_CONFIG, inst)\
	DMA_HC32_ERR_IRQ_CONFIG(inst)                                                     \
}

#define DMA_HC32_DEFINE_FCG_CONFIG(inst)                                              \
static void dma_hc32_##inst##_fcg_configure(void)                                     \
{                                                                                     \
	struct device *clock = device_get_binding(CLOCK_CONTROL);                         \
	static struct hc32_modules_clock_sys fcg_cfg[2] = {                               \
		{                                                                             \
			.bus = DT_XHSC_HC32_DMA_##inst##_CLOCK_BUS_0,                             \
			.fcg = DT_XHSC_HC32_DMA_##inst##_CLOCK_FCG_0,                             \
			.bits = DT_XHSC_HC32_DMA_##inst##_CLOCK_BITS_0                            \
		},                                                                            \
		{                                                                             \
			.bus = DT_XHSC_HC32_DMA_##inst##_CLOCK_BUS_1,                             \
			.fcg = DT_XHSC_HC32_DMA_##inst##_CLOCK_FCG_1,                             \
			.bits = DT_XHSC_HC32_DMA_##inst##_CLOCK_BITS_1                            \
		}                                                                             \
	};                                                                                \
	(void)clock_control_on(clock, (clock_control_subsys_t)&fcg_cfg[0]);               \
	(void)clock_control_on(clock, (clock_control_subsys_t)&fcg_cfg[1]);               \
}

#define DMA_HC32_AOS_CH_CONFIGURE(ch, inst)                                           \
	dma_hc32_##inst##_data.channels[ch].aos_source = EVT_SRC_AOS_STRG;

#define DMA_HC32_DEFINE_AOS_CONFIG(inst)                                                  \
static void dma_hc32_##inst##_aos_configure(void)                                         \
{                                                                                         \
	UTIL_LISTIFY(DT_XHSC_HC32_DMA_##inst##_DMA_CHANNELS, DMA_HC32_AOS_CH_CONFIGURE, inst) \
}

#define HC32_DMA_INIT(inst)                                                                   \
	UTIL_LISTIFY(DT_XHSC_HC32_DMA_##inst##_DMA_CHANNELS, DMA_HC32_DEFINE_TC_IRQ_HANDLER, inst)\
	DMA_HC32_DEFINE_ERR_IRQ_HANDLER(inst)                                                     \
	static struct dma_hc32_channel                                                            \
		dma_hc32_##inst##_channels[DT_XHSC_HC32_DMA_##inst##_DMA_CHANNELS];                   \
	static struct dma_hc32_data dma_hc32_##inst##_data = {                                    \
		.channels = dma_hc32_##inst##_channels,                                               \
	};                                                                                        \
	DMA_HC32_DEFINE_IRQ_CONFIG(inst)                                                          \
	DMA_HC32_DEFINE_FCG_CONFIG(inst)                                                          \
	DMA_HC32_DEFINE_AOS_CONFIG(inst)                                                          \
	static const struct dma_hc32_config dma_hc32_##inst##_config = {                          \
		.base = DT_XHSC_HC32_DMA_##inst##_BASE_ADDRESS,                                       \
		.channels = DT_XHSC_HC32_DMA_##inst##_DMA_CHANNELS,                                   \
		.fcg_configure = dma_hc32_##inst##_fcg_configure,                                     \
		.irq_configure = dma_hc32_##inst##_irq_configure,                                     \
		.aos_configure = dma_hc32_##inst##_aos_configure,                                     \
	};                                                                                        \
                                                                                              \
	DEVICE_AND_API_INIT(dma_hc32_##inst, DT_XHSC_HC32_DMA_##inst##_LABEL, &dma_hc32_init,     \
		    	&dma_hc32_##inst##_data, &dma_hc32_##inst##_config,                           \
		    	PRE_KERNEL_1, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,                             \
		    	(void *)&dma_hc32_driver_api);                                                \

#if defined(DT_XHSC_HC32_DMA_0)
#if (DT_XHSC_HC32_DMA_0)
HC32_DMA_INIT(0)
#endif
#endif

#if defined(DT_XHSC_HC32_DMA_0)
#if (DT_XHSC_HC32_DMA_1)
HC32_DMA_INIT(1)
#endif
#endif

#if (!defined(DT_XHSC_HC32_DMA_0)) && (!defined(DT_XHSC_HC32_DMA_1))
#error "No DMA nodes are okay in the DTS"
#endif
